app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE (user_id = 2)
SELECT "products".* FROM "products" WHERE "products"."id" IN (?, ?)  [["id", 1], ["id", 2]]
---
  def index
    @orders = Order.includes(:product).all