app/controllers/products_controller.rb

  def index
    if params[:q]
      search_term = params[:q]
      @products = Product.search(search_term)
---
SELECT "products".* FROM "products" WHERE (name LIKE '%3%')

  def show
      @product = Product.find(params[:id])

      # @comments = @product.comments.order("created_at DESC")
      # @comments = Comment.paginate(:page => params[:page], :per_page => 5)

      @comments = @product.comments.paginate(:page => params[:page], :per_page => 5).order("created_at DESC")
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."product_id" = ? ORDER BY created_at DESC LIMIT ? OFFSET ?  [["product_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."product_id" = ?  [["product_id", 1]]

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "description", "image_url", "created_at", "updated_at", "colour") VALUES (?, ?, ?, ?, ?, ?)  [["name", "fff"], ["description", ""], ["image_url", ""], ["created_at", "2018-10-26 01:18:41.614340"], ["updated_at", "2018-10-26 01:18:41.614340"], ["colour", ""]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "colour" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["colour", "Bluef"], ["updated_at", "2018-10-26 00:35:21.064152"], ["id", 1]]